app/controllers/api/v1/receipts_controller.rb

    def index
      render json: Receipt.all, status: 200
---
SELECT "receipts".* FROM "receipts"

    def create
      if user_signed_in?
        receipt = Receipt.create(receipt_params)
---
INSERT INTO "receipts" ("image") VALUES ($1) RETURNING "id"  [["image", "ihcxn2du5ui4lpngdb6v"]]

    def transcribe(receipt)
      img_url = 'https://res.cloudinary.com/dmqtrnawm/image/upload/q_auto:low/' + receipt.image + '.jpg'
      uri = URI.parse('https://vision.googleapis.com/v1/images:annotate?key=' + 'XXXX')
      request = Net::HTTP::Post.new(uri)
      request.content_type = 'application/json'
      request.body = JSON.dump('requests' => [{ 'image' => { 'source' => { 'imageUri' => img_url } }, 'features' => [{ 'type' => 'TEXT_DETECTION', 'maxResults' => 1, 'model' => 'builtin/latest' }] }])
      req_options = { use_ssl: uri.scheme == 'https' }
      response = Net::HTTP.start(uri.hostname, uri.port, req_options) do |http|
        http.request(request)
      end

      # These can be helpful for working out issues
      p response
      p response.code
      p response.body

      # if response.code.equal?()

      data = JSON.parse(response.body)

      if data.blank? || data['responses'][0].blank? || data['responses'][0]['textAnnotations'][0].blank? || data['responses'][0]['textAnnotations'][0]['description'].blank?
        receipt.destroy!
---
DELETE FROM "receipts" WHERE "receipts"."id" = $1  [["id", 4]]


        receipt.total = total
        receipt.date = date
        receipt.save!
---
UPDATE "receipts" SET "total" = $1, "date" = $2 WHERE "receipts"."id" = $3  [["total", "9.45"], ["date", "None Found"], ["id", 14]]